# GetColorSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..GetColorSettings Method
AnalysisDisplayStyle Class See Also
---
Get color settings object from the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayColorSettings GetColorSettings()
```

Visual Basic
---
```text
Public Function GetColorSettings As AnalysisDisplayColorSettings
```

Visual C++
---
```text
public:
AnalysisDisplayColorSettings^ GetColorSettings()
```

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace